{
    "version": {
        "date": "2019-10-27 00:05:47",
        "plugin": "infohub_welcome",
        "data_checksum": "92f9a33948f666c8e25f667f1923ddc1",
        "language": "",
        "country": "",
        "file_type": "finished_file"
    },
    "launcher": {
        "title": "Bienvenido",
        "description": "Bienvenido a InfoHub. Este es un viaje inspirador que InfoHub puede hacer y hará en el futuro."
    },
    "data": {
        "infohub_welcome_menu": {
            "Welcome": "Bienvenido",
            "You can do all this": "Puedes hacer todo esto",
            "If you like tech": "Si te gusta la tecnología"
        },
        "infohub_welcome_tech": {
            "InfoHub": "InfoHub",
            "This is not about sharing. InfoHub is about your private data, encrypted on your own trusted server. Your own place on the internet that you can access whenever you want to.": "No se trata de compartir. InfoHub se trata de sus datos privados, encriptados en su propio servidor de confianza. Su propio lugar en Internet al que puede acceder cuando lo desee",
            "Quick facts": "Datos rápidos",
            "InfoHub is GPL3 licensed": "InfoHub tiene licencia GPL3",
            "Full documentation at [infohub_link]": "Documentación completa en [infohub_link]",
            "Plugins work and look the same on both client and server": "Los complementos funcionan y tienen el mismo aspecto tanto en el cliente como en el servidor",
            "Messages flow in the system": "Los mensajes fluyen en el sistema",
            "Subcall to any plugin on any node": "Llamada secundaria a cualquier complemento en cualquier nodo",
            "Plugins autostart when needed": "Inicio automático de complementos cuando sea necesario",
            "Client renderers manage the HTML": "Los renderizadores de clientes administran el HTML",
            "Client never refresh the page": "El cliente nunca actualiza la página",
            "Client use local storage for offline use": "El cliente utiliza el almacenamiento local para uso sin conexión",
            "Logging to file and console": "Registro en archivo y consola",
            "Plugins in PHP and Javascript": "Complementos en PHP y Javascript",
            "Strongly typed (Yes you read right)": "Fuertemente escrito (Sí, has leído bien)",
            "Automatic tests write themselfs (yes you read right)": "Las pruebas automáticas se escriben a sí mismas (sí, has leído bien)",
            "Quick kick out tests at the door": "Pruebas de expulsión rápida en la puerta",
            "Domains can get different contents": "Los dominios pueden obtener diferentes contenidos",
            "Did I mention fully responsive?": "¿Mencioné completamente receptivo?",
            "The generic web platform": "La plataforma web genérica",
            "A platform take care of all the stuff that you know you need but would take ages to write. There are many popular platforms, here are a few popular ones: Magento, Wordpress, Joomla, Drupal. They are targeting different areas and can be expanded with modules. InfoHub is a generic platform. It does nothing until it gets some plugins that tell it what to do. There are some demo plugins included.": "Una plataforma se encarga de todo lo que sabes que necesitas pero llevaría años escribir. Hay muchas plataformas populares, aquí hay algunas populares: Magento, Wordpress, Joomla, Drupal. Están dirigidas a diferentes áreas y se puede ampliar con módulos. InfoHub es una plataforma genérica. No hace nada hasta que obtiene algunos complementos que le dicen qué hacer. Hay algunos complementos de demostración incluidos ",
            "Getting started": "Primeros pasos",
            "GPL 3 licensed. No costs for you to get started. Just download and install. InfoHub installation is simple, copy very few files, and you are on.": "Licencia GPL 3. Sin costo para que pueda comenzar. Simplemente descargue e instale. La instalación de InfoHub es simple, copie muy pocos archivos y ya está",
            "Workbench": "Banco de trabajo",
            "With the optional Workbench you can start plugins and se the graphical user interface. This turns Infohub into a web operating system.": "Con Workbench opcional puede iniciar complementos y ver la interfaz gráfica de usuario. Esto convierte a Infohub en un sistema operativo web",
            "You can write plugins": "Puede escribir complementos",
            "Plugins are simple to create, copy the infohub_plugin template to a new name and start coding.You can write javascript plugings for the client and php plugins for the server. The way you do it is identical and works identical.": "Los complementos son fáciles de crear, copie la plantilla infohub_plugin a un nuevo nombre y comience a codificar. Puede escribir complementos de JavaScript para el cliente y complementos php para el servidor. La forma en que lo hace es idéntica y funciona idéntica",
            "Lead words in building InfoHub": "Palabras principales en el edificio InfoHub",
            "[b]No exceptions[/b] That means all data are stored in Storage. All traffic are redirected with Exchange. Everyone have to login to access data.": "[b] Sin excepciones [/b]  Eso significa que todos los datos se almacenan en Almacenamiento. Todo el tráfico se redirige con Exchange. Todos deben iniciar sesión para acceder a los datos",
            "[b]Make it simple[/b] Simple means to write code that everyone can read. Simple code often mean fast code. Choose simple over fast but avoid slow code. Choose solutions that are simple to understand and simple to implement. Let InfoHub stay small, simple and fast. Put new abilities in plugins.": "[b] Hazlo simple [/b]  Simple significa escribir código que todos puedan leer. Código simple a menudo significa código rápido. Elige simple sobre rápido pero evita código lento. Elige soluciones que sean simples de entender y simples para implementar. Deje que InfoHub permanezca pequeño, simple y rápido. Ponga nuevas habilidades en complementos ",
            "[b]Self containing[/b] Plugin have no dependencies on other plugins. Plugin can be used in other projects with no changes.": "[b] Complemento autocontenido [/b]  no tiene dependencias de otros complementos. El complemento se puede utilizar en otros proyectos sin cambios",
            "Independent plugins": "Complementos independientes",
            "Each plugin is just one file, one class, and they all extend the base class. Each plugin can be used independently in another environment if you like. Give an array to the plugin, the plugin handle the array and give you an array with the answer.": "Cada complemento es solo un archivo, una clase, y todos extienden la clase base. Cada complemento se puede usar de forma independiente en otro entorno si lo desea. Dele una matriz al complemento, el complemento maneja la matriz y le da eres una matriz con la respuesta ",
            "Message flow": "Flujo de mensajes",
            "InfoHub Exchange take care of the messages between the plugins. Messages are sent between the client and server without any effort. You can do a sub call from and to any node. Nodes are the client, the server and other InfoHub servers that got node names. Each message contain its own call stack and can find its own way back to the caller.": "InfoHub Exchange se encarga de los mensajes entre los complementos. Los mensajes se envían entre el cliente y el servidor sin ningún esfuerzo. Puede realizar una sub llamada desde y hacia cualquier nodo. Los nodos son el cliente, el servidor y otros InfoHub servidores que obtuvieron nombres de nodo. Cada mensaje contiene su propia pila de llamadas y puede encontrar su propio camino de regreso a la persona que llama ",
            "Automatic plugin start": "Inicio automático del complemento",
            "If a message goes to a plugin that is not started then it is put aside and the plugin is requested. When the plugin have started then the messages to that plugin come back in the flow.": "Si un mensaje va a un complemento que no se inició, se deja de lado y se solicita el complemento. Cuando el complemento se ha iniciado, los mensajes de ese complemento vuelven al flujo",
            "Web workers": "Trabajadores web",
            "(Under development) In the browser your plugins run as web workers to make sure they are encapsulated and restricted from much of the browser features.": "(En desarrollo) En el navegador, sus complementos se ejecutan como trabajadores web para asegurarse de que están encapsulados y restringidos de muchas de las funciones del navegador",
            "Logging": "Registro",
            "You can enable logging in the general configuration, then the server logs to files and the client logs to the console. The console messages are a great source for finding errors. You do not have to add any logging commands to your code. That is taken care of by the caller functions Cmd() and internal_Cmd().": "Puede habilitar el inicio de sesión en la configuración general, luego el servidor inicia sesión en los archivos y el cliente inicia sesión en la consola. Los mensajes de la consola son una excelente fuente para encontrar errores. No tiene que agregar ningún comando de inicio de sesión a su código. De eso se ocupan las funciones de llamada Cmd () y internal_Cmd (). ",
            "Caller functions": "Funciones de llamada",
            "Each plugin have only one public function: Cmd(). The message goes into that function and it calls the right cmd function. You will get an array back from Cmd with the answer. The Cmd function take care of logging, error handling, measure execution time, check the incoming variables in the array, returns a return-message or a subcall-message.": "Cada complemento tiene una sola función pública: Cmd (). El mensaje entra en esa función y llama a la función cmd correcta. Obtendrá una matriz de Cmd con la respuesta. La función Cmd se encarga del registro , manejo de errores, medir el tiempo de ejecución, verificar las variables entrantes en la matriz, devuelve un mensaje de retorno o un mensaje de subcall ",
            "InfoHub inner workings": "Funcionamiento interno de InfoHub",
            "Every box is a plugin. Infohub Storage use plugins that specialise on each database type. Infohub Render get HTML from the renderers and send to InfoHub View. All is just plugins and you can write your own too.": "Cada cuadro es un complemento. Infohub Storage utiliza complementos que se especializan en cada tipo de base de datos. Infohub Render obtiene HTML de los renderizadores y los envía a InfoHub View. Todo es solo complementos y también puede escribir el suyo",
            "SubCall or Return message": "Mensaje de llamada secundaria o devolución",
            "A plugin always return a valid message that can be released to the flow. The message is either a return message, or a subcall message. You can do a sub call in your function to anywhere and then expect the very same function to get a return message with data. You can attach variables in the sub call that will return untouched. See the demos for a ”step” variable.": "Un complemento siempre devuelve un mensaje válido que se puede liberar al flujo. El mensaje es un mensaje de retorno o un mensaje de sub-llamada. Puede hacer una sub-llamada en su función a cualquier lugar y luego esperar lo mismo función para obtener un mensaje de retorno con datos. Puede adjuntar variables en la llamada secundaria que devolverán intactas. Consulte las demostraciones para una variable paso",
            "Strongly typed": "Fuertemente escrito",
            "PHP and Javascript can do type juggeling without saying a pip. That is great. A great source of agony when you can\\'t find where it have type casted and destroyed your data. Each function in every plugin start by setting default values. Now you know that the incoming array contain what you expect and nothing more.": "PHP y Javascript pueden hacer malabarismos de texto sin decir un pip. Eso es genial. Una gran fuente de agonía cuando no puede encontrar dónde ha introducido y destruido sus datos. Cada función en cada complemento comienza estableciendo valores predeterminados. Ahora sabe que la matriz entrante contiene lo que espera y nada más ",
            "what about HTML?": "¿qué pasa con HTML?",
            "The plugin infohub_view take care of the content boxes on the screen. You can say things like: Insert this HTML in the left box, in the middle of the other boxes. Then your box will be inserted there with your HTML. There are plugins that handle HTML, the renderers. Normal plugins, you give them an array and get an array back with the HTML.": "El plugin infohub_view se ocupa de los cuadros de contenido en la pantalla. Puede decir cosas como: Inserte este HTML en el cuadro de la izquierda, en el medio de los otros cuadros. Luego su cuadro se insertará allí con su HTML . Hay complementos que manejan HTML, los renderizadores. Complementos normales, les das una matriz y obtienes una matriz con el HTML. ",
            "Renderers": "Representadores",
            "Ready to use renderers for text, maps, images, lists, audio, video, links, forms. You can write your own renderers, it is just normal plugins.": "Procesadores listos para usar para texto, mapas, imágenes, listas, audio, video, enlaces, formularios. Puede escribir sus propios procesadores, son solo complementos normales",
            "Kick out tests": "Pruebas de expulsión",
            "InfoHub would just love to kick you out if you do not behave exactly as expected. Every call you make must pass the quick tests. There is a ban system that always give you 1 second ban time for a valid call, and more for an invalid call.": "A InfoHub le encantaría echarte si no te comportas exactamente como se esperaba. Cada llamada que hagas debe pasar las pruebas rápidas. Hay un sistema de prohibición que siempre te da un tiempo de prohibición de 1 segundo para una llamada válida, y más para una llamada no válida ",
            "Automated tests": "Pruebas automatizadas",
            "An InfoHub plugin expect an incoming array and give an you an array back. There are no other sources of input or output, no global variables etc. The test system ask the plugin what functions it has and then call each of them with data from the test file, or an empty array. The function get the default values and give the default answer. The arrays are saved in a test file for each plugin. In a future release I will also save live data to the test system. This means that the tests write them self.": "Un complemento de InfoHub espera una matriz entrante y le devuelve una matriz. No hay otras fuentes de entrada o salida, no hay variables globales, etc. El sistema de prueba pregunta al complemento qué funciones tiene y luego llama a cada una de ellas. ellos con datos del archivo de prueba, o una matriz vacía. La función obtiene los valores predeterminados y da la respuesta predeterminada. Las matrices se guardan en un archivo de prueba para cada complemento. En una versión futura también guardaré datos en vivo para la prueba sistema. Esto significa que las pruebas las escriben ellos mismos ",
            "Automated inspections": "Inspecciones automatizadas",
            "Third party interactions from the client is not allowed. The client only speak with the server. An inspector patrol the HTML and give a warning for any external link.": "No se permiten interacciones de terceros con el cliente. El cliente solo habla con el servidor. Un inspector patrulla el HTML y da una advertencia sobre cualquier enlace externo",
            "Multi domain": "Dominio múltiple",
            "One website can have multiple domains and sub domains. You define in the global configuration what start message should be send for each domain. There is a default fallback. You can then get different contents for each domain.": "Un sitio web puede tener múltiples dominios y subdominios. Usted define en la configuración global qué mensaje de inicio debe enviarse para cada dominio. Hay una reserva predeterminada. Luego puede obtener diferentes contenidos para cada dominio",
            "Multi nodes": "Nodos múltiples",
            "The client can only talk with the server. The server can talk with other Infohub servers on the internet. Each party is called a Node. You need login credentials to a node to exchange messages.": "El cliente solo puede hablar con el servidor. El servidor puede hablar con otros servidores de Infohub en Internet. Cada parte se denomina Nodo. ​​Necesita credenciales de inicio de sesión en un nodo para intercambiar mensajes",
            "History": "Historia",
            "The idea about a message driven system came to me in 1990 while I was designing hardware. What about a system with independent modules that can send messages to each other. My thought was that we by 2010 would expand our computers with processor modules, graphics modules, storage modules, power modules, etc in infinity. By 2000 I designed a CMS system for my home page. Written in ASP and Access databases. A great learning. Some of the ideas are now in InfoHub. 2010-01-01 started development of InfoHub. I could work some hours low quality time here and there but I never gave up. By late 2011 I became a programmer by profession, and by now I am a professional programmer. We are at 2019 and I am proud to present to you InfoHub core.": "La idea de un sistema basado en mensajes surgió en 1990 cuando estaba diseñando hardware. ¿Qué pasa con un sistema con módulos independientes que pueden enviarse mensajes? Pensé que para 2010 expandiríamos nuestras computadoras con módulos de procesador, módulos gráficos, módulos de almacenamiento, módulos de potencia, etc. en infinito. n Para el año 2000, diseñé un sistema CMS para mi página de inicio. Escrito en bases de datos ASP y Access. Un gran aprendizaje. Algunas de las ideas son ahora en InfoHub. 2010-01-01 comencé el desarrollo de InfoHub. Podría trabajar algunas horas con un tiempo de baja calidad aquí y allá, pero nunca me di por vencido. A finales de 2011 me convertí en un programador de profesión, y ahora soy un programador profesional. estamos en 2019 y me enorgullece presentarles el núcleo de InfoHub ",
            "Infohub": "Infohub"
        },
        "infohub_welcome_welcome": {
            "Welcome to your Infohub": "Bienvenido a su Infohub",
            "We are going to have so much fun.": "Nos vamos a divertir mucho"
        },
        "infohub_welcome_youcan": {
            "You can, -with Infohub": "Puede, con Infohub",
            "Calendar": "Calendario",
            "Write and find data in your calendar. History and future is just as important. Do not miss name days, birthdays, anniversaries, holidays, events. You can see times for the sun and moon. Links to Wikipedia for names and holidays so you can read more.": "Escriba y encuentre datos en su calendario. La historia y el futuro son igual de importantes. No se pierda los días de nombre, cumpleaños, aniversarios, días festivos, eventos. Puede ver los horarios del sol y la luna. Enlaces a Wikipedia para los nombres y días festivos para que puedas leer más ",
            "Tree": "Árbol",
            "With Tree you start with yourself and make bubbles on subjects around you. You could create a bubble for your cars. During your lifetime you might own more than one car and create a bubble for each car. Perhaps attach a photo and fill with any data you like. Perhaps you want a service bubble in your car to register all service you have done. When did you go to the dentist? You can create any bubble and fill the bubble with data and link to other bubbles. You can create a web with bubbles and connections - your life experiences.": "Con Tree comienzas contigo mismo y haces burbujas en los sujetos que te rodean. Puedes crear una burbuja para tus autos. Durante tu vida podrías tener más de un auto y crear una burbuja para cada auto. Quizás adjunte una foto y complete con los datos que desee. Quizás desee una burbuja de servicio en su automóvil para registrar todo el servicio que ha realizado. ¿Cuándo fue al dentista? Puede crear cualquier burbuja y llenarla con datos y vincularla a otras burbujas. Puedes crear una web con burbujas y conexiones: tus experiencias de vida ",
            "Body": "Cuerpo",
            "You are important! You can not exist without your body. That makes also your body important! With Body you get practical tips how you can improve your health. You can track your improvements. It is the small decisions you do every day that make a difference in your life.": "¡Eres importante! No puedes existir sin tu cuerpo. ¡Eso también hace que tu cuerpo sea importante! Con Body obtienes consejos prácticos sobre cómo puedes mejorar tu salud. Puedes seguir tus mejoras. Son las pequeñas decisiones que tomas todos los días que marcan la diferencia en tu vida ",
            "Story editor": "Editor de historias",
            "Put together an article with text, images, image texts, links, titles, ingress, bullet lists, code examples. You can then export your story and use it outside of InfoHub or store it in your Tree.": "Arme un artículo con texto, imágenes, textos de imágenes, enlaces, títulos, entradas, listas de viñetas, ejemplos de código. Luego puede exportar su historia y usarla fuera de InfoHub o almacenarla en su Árbol",
            "Things": "Cosas",
            "Register your larger things: What it is, when and where you bought it, the serial number, warranty and so on.": "Registre sus cosas más grandes: qué es, cuándo y dónde lo compró, el número de serie, la garantía y así.",
            "Register you cars here and all service you have done to the cars. Or your sneekers collection.": "Registre sus autos aquí y todo el servicio que ha prestado a los autos. O su colección de sneekers",
            "Usage": "Uso",
            "Here you can register when you use one of your registered things. It could for example be one of your sneekers while training.": "Aquí puedes registrarte cuando utilizas una de tus cosas registradas. Podría ser, por ejemplo, uno de tus sneekers mientras entrenas",
            "Planning": "Planificación",
            "Your projects. You can set up tasks in projects here. Date when things must be done and when they were done.": "Sus proyectos. Puede configurar tareas en proyectos aquí. Fecha en que se deben hacer las cosas y cuándo se hicieron",
            "Diary": "Diario",
            "How was your day. Write the text version of your day and use links to your data.": "Cómo estuvo tu día. Escribe la versión de texto de tu día y usa enlaces a tus datos",
            "Media": "Medios",
            "Media is images/video/audio - Your catalog with media and its meta data.": "Los medios son imágenes / video / audio: su catálogo con los medios y sus metadatos",
            "You can see small versions of your images and mark the persons faces and connect them to contacts, places, travels, dates.": "Puede ver versiones pequeñas de sus imágenes y marcar las caras de las personas y conectarlas a contactos, lugares, viajes, fechas",
            "Contact": "Contacto",
            "The contact information to your friends. Telephone number, email, Skype, Address, birthday, shoe size or whatever you like to register about your contacts.": "La información de contacto de sus amigos. Número de teléfono, correo electrónico, Skype, dirección, fecha de nacimiento, talla de zapatos o lo que quiera registrar sobre sus contactos",
            "Budget": "Presupuesto",
            "Calculate your income and expected expenses in this plugin. You can then see what is reasonable to invest in.": "Calcule sus ingresos y gastos esperados en este complemento. Luego podrá ver en qué es razonable invertir",
            "Expense": "Gastos",
            "Register your purchases to keep track where the money goes. Put expences in groups so you see how much your car cost, your hobby, food etc.": "Registre sus compras para realizar un seguimiento de dónde va el dinero. Coloque los gastos en grupos para que vea cuánto cuesta su automóvil, su pasatiempo, comida, etc.",
            "Perhaps you can cut costs without cutting down on comfort. You need a clear picture of your expences to take the right decisions.": "Quizás pueda reducir costos sin reducir la comodidad. Necesita una imagen clara de sus gastos para tomar las decisiones correctas",
            "Review": "Revisión",
            "Write your reviews of films, books, records, TV series, games, subscriptions, magazines. Then you can see what movies you have seen and when you saw them.": "Escriba sus reseñas de películas, libros, discos, series de televisión, juegos, suscripciones, revistas. Luego podrá ver qué películas ha visto y cuándo las vio",
            "Place": "Lugar",
            "You can register places you have visited and get a map with dots. You can also link a place to a story, image, training and so on.": "Puede registrar lugares que ha visitado y obtener un mapa con puntos. También puede vincular un lugar a una historia, imagen, capacitación, etc.",
            "Event": "Evento",
            "Register events you want to participate in or have participated in. You can link a place, a review etc.": "Registre los eventos en los que desea participar o en los que haya participado. Puede vincular un lugar, una reseña, etc."
        }
    }
}