{
    "version": {
        "date": "2019-10-27 00:05:47",
        "plugin": "infohub_welcome",
        "data_checksum": "92f9a33948f666c8e25f667f1923ddc1",
        "language": "",
        "country": "",
        "file_type": "finished_file"
    },
    "data": {
        "infohub_welcome_menu": {
            "Welcome": "Välkommen",
            "You can do all this": "Du kan göra allt detta",
            "If you like tech": "Om du gillar teknik"
        },
        "infohub_welcome_tech": {
            "InfoHub": "InfoHub",
            "This is not about sharing. InfoHub is about your private data, encrypted on your own trusted server. Your own place on the internet that you can access whenever you want to.": "Det här handlar inte om att dela. InfoHub handlar om dina privata data, krypterade på din egen betrodda server. Din egen plats på internet som du kan komma åt när du vill.",
            "Quick facts": "Snabbfakta",
            "InfoHub is GPL3 licensed": "InfoHub är GPL3-licensierad",
            "Full documentation at [infohub_link]": "Fullständig dokumentation på [infohub_link]",
            "Plugins work and look the same on both client and server": "Plugins fungerar och ser lika dana ut på både klient som server",
            "Messages flow in the system": "Meddelanden flyter i systemet",
            "Subcall to any plugin on any node": "Gör funktionsanrop till någon plugin på vilken nod som helst",
            "Plugins autostart when needed": "Plugins autostartar vid behov",
            "Client renderers manage the HTML": "Klientrenderare hanterar HTML",
            "Client never refresh the page": "Klienten uppdaterar aldrig sidan",
            "Client use local storage for offline use": "Klient använder lokal lagring för frånkopplad användning",
            "Logging to file and console": "Loggar till fil och konsol",
            "Plugins in PHP and Javascript": "Plugins i PHP och Javascript",
            "Strongly typed (Yes you read right)": "Starka variabeltyper (Ja du läste rätt)",
            "Automatic tests write themselfs (yes you read right)": "Automatiska tester skriver sig själva (ja du läser rätt)",
            "Quick kick out tests at the door": "Snabba tester som sparkar ut meddelanden redan vid dörren",
            "Domains can get different contents": "Domäner kan ha olika innehåll",
            "Did I mention fully responsive?": "Nämnde jag att gränssnittet anpassar sig efter skärmen?",
            "The generic web platform": "Den generiska webbplattformen",
            "A platform take care of all the stuff that you know you need but would take ages to write. There are many popular platforms, here are a few popular ones: Magento, Wordpress, Joomla, Drupal. They are targeting different areas and can be expanded with modules. InfoHub is a generic platform. It does nothing until it gets some plugins that tell it what to do. There are some demo plugins included.": "En plattform tar hand om alla saker som du vet att du behöver men skulle ta evigheter att skriva själv. Det finns många populära plattformar, här är några populära: Magento, Wordpress, Joomla, Drupal. De riktar sig till olika områden och kan utökas med moduler. InfoHub är en generisk plattform. Den gör ingenting förrän den får några plugins som säger vad de ska göra. Det finns några demo-plugins inkluderade. ",
            "Getting started": "Komma igång",
            "GPL 3 licensed. No costs for you to get started. Just download and install. InfoHub installation is simple, copy very few files, and you are on.": "GPL 3 licensierade. Inga kostnader för dig att komma igång. Ladda bara ner och installera. InfoHub-installationen är enkel, kopiera några filer och du är igång.",
            "Workbench": "Arbetsbänk",
            "With the optional Workbench you can start plugins and se the graphical user interface. This turns Infohub into a web operating system.": "Med den valfria Workbench kan du starta plugins och se det grafiska användargränssnittet. Detta förvandlar Infohub till ett webboperativsystem.",
            "You can write plugins": "Du kan skriva plugins",
            "Plugins are simple to create, copy the infohub_plugin template to a new name and start coding.You can write javascript plugings for the client and php plugins for the server. The way you do it is identical and works identical.": "Plugins är enkla att skapa, kopiera mallen infohub_plugin till ett nytt namn och börja koda. Du kan skriva javascript-plug-in för klienten och php-plugins för servern. Du gör exakt samma på klienten som servern.",
            "Lead words in building InfoHub": "Ledord för att bygga InfoHub",
            "[b]No exceptions[/b] That means all data are stored in Storage. All traffic are redirected with Exchange. Everyone have to login to access data.": "[b] Inga undantag [/b]  Det betyder att all data lagras i Storage. All trafik omdirigeras med Exchange. Alla måste logga in för att få åtkomst till data.",
            "[b]Make it simple[/b] Simple means to write code that everyone can read. Simple code often mean fast code. Choose simple over fast but avoid slow code. Choose solutions that are simple to understand and simple to implement. Let InfoHub stay small, simple and fast. Put new abilities in plugins.": "[b] Gör det enkelt [/b]  Enkelt betyder att skriva kod som alla kan läsa. Enkel kod betyder ofta snabb kod. Välj enkel före snabb kod men undvik långsam kod. Välj lösningar som är enkla att förstå och enkla att implementera. Låt InfoHub förbli liten, enkel och snabb. Lägg nya förmågor i plugins. ",
            "[b]Self containing[/b] Plugin have no dependencies on other plugins. Plugin can be used in other projects with no changes.": "[b] Självförsörjande [/b]  Plugin har inga beroende av andra plugins. Plugin kan användas i andra projekt utan förändringar.",
            "Independent plugins": "Oberoende plugins",
            "Each plugin is just one file, one class, and they all extend the base class. Each plugin can be used independently in another environment if you like. Give an array to the plugin, the plugin handle the array and give you an array with the answer.": "Varje plugin är bara en fil, en klass och de utökar alla basklassen. Varje plugin kan användas oberoende i en annan miljö om du vill. Ge en array till pluginen, pluginen hanterar arrayen och ger dig en array med svaret. ",
            "Message flow": "Meddelandeflöde",
            "InfoHub Exchange take care of the messages between the plugins. Messages are sent between the client and server without any effort. You can do a sub call from and to any node. Nodes are the client, the server and other InfoHub servers that got node names. Each message contain its own call stack and can find its own way back to the caller.": "InfoHub Exchange tar hand om meddelandena mellan plugins. Meddelanden skickas mellan klienten och servern utan någon ansträngning. Du kan göra ett anrop från och till vilken nod som helst. Noderna är klienten, servern och andra InfoHub servrar som har nodnamn. Varje meddelande innehåller sin egen samtalstack och kan hitta sin egen väg tillbaka till den som anropar.",
            "Automatic plugin start": "Automatisk plugin-start",
            "If a message goes to a plugin that is not started then it is put aside and the plugin is requested. When the plugin have started then the messages to that plugin come back in the flow.": "Om ett meddelande går till ett plugin som inte redan är startad så läggs det åt sidan och den saknade plugin begärs. När plugin har startat kommer meddelandena till det plugin tillbaka i flödet.",
            "Web workers": "Webbarbetare",
            "(Under development) In the browser your plugins run as web workers to make sure they are encapsulated and restricted from much of the browser features.": "(Under utveckling) I webbläsaren kör dina plugins som webbarbetare för att se till att de är inkapslade och begränsade från mycket av webbläsarfunktionerna.",
            "Logging": "Loggning",
            "You can enable logging in the general configuration, then the server logs to files and the client logs to the console. The console messages are a great source for finding errors. You do not have to add any logging commands to your code. That is taken care of by the caller functions Cmd() and internal_Cmd().": "Du kan aktivera loggning i den allmänna konfigurationen, sedan loggar servern till filer och klientloggarna till konsolen. Konsolmeddelandena är en bra källa för att hitta fel. Du behöver inte lägga till några loggningskommandon till dina kod. Det tas om hand av funktionerna Cmd () och internal_Cmd (). ",
            "Caller functions": "Samtalsfunktioner",
            "Each plugin have only one public function: Cmd(). The message goes into that function and it calls the right cmd function. You will get an array back from Cmd with the answer. The Cmd function take care of logging, error handling, measure execution time, check the incoming variables in the array, returns a return-message or a subcall-message.": "Varje plugin har bara en offentlig funktion: Cmd(). Meddelandet går in i den funktionen och den i sin tur kallar på rätt cmd-funktion. Du kommer att få en array tillbaka från Cmd med svaret. Cmd-funktionen tar hand om loggning, felhantering, mäta exekveringstid, kontrollera de inkommande variablerna i arrayen, returnerar ett returmeddelande eller ett subcall-meddelande. ",
            "InfoHub inner workings": "InfoHub intern struktur",
            "Every box is a plugin. Infohub Storage use plugins that specialise on each database type. Infohub Render get HTML from the renderers and send to InfoHub View. All is just plugins and you can write your own too.": "Plugins håller sig i sin egen box på skärmen. Renderaren använder plugins som är specialiserade på att skapa en viss typ av HTML. All HTML skickas sedan till infohub_view för att visas på skärmen. Allt är bara plugins och du kan skriva dina egen.",
            "SubCall or Return message": "SubCall eller Return meddelande",
            "A plugin always return a valid message that can be released to the flow. The message is either a return message, or a subcall message. You can do a sub call in your function to anywhere and then expect the very same function to get a return message with data. You can attach variables in the sub call that will return untouched. See the demos for a ”step” variable.": "En plugin returnerar alltid ett giltigt meddelande som kan släppas till flödet av meddelanden. Meddelandet är antingen ett returmeddelande eller ett anropsmeddelande. Du kan göra ett anrop i din funktion var som helst och sedan förvänta dig att få ett returmeddelande med data. Du kan bifoga variabler i anropet som kommer tillbaka orörda. Se infohub_demo för att se hur en steg-variabel fungerar.",
            "Strongly typed": "Starka datatyper",
            "PHP and Javascript can do type juggeling without saying a pip. That is great. A great source of agony when you can\\'t find where it have type casted and destroyed your data. Each function in every plugin start by setting default values. Now you know that the incoming array contain what you expect and nothing more.": "PHP och Javascript kan göra datatypjonglering utan att varna dig när det blir misstag. Det kan avra svårt att hitta var den har jonglerat med datatyperna och förstört dina data. Varje funktion i varje plugin startar genom att ställa in standardvärden. Nu vet du att den inkommande arrayern innehåller vad du förväntar dig och ingenting mer. ",
            "what about HTML?": "hur är det med HTML?",
            "The plugin infohub_view take care of the content boxes on the screen. You can say things like: Insert this HTML in the left box, in the middle of the other boxes. Then your box will be inserted there with your HTML. There are plugins that handle HTML, the renderers. Normal plugins, you give them an array and get an array back with the HTML.": "Plugin infohub_view tar hand om innehållslådorna på skärmen. Du kan säga saker som: Sätt in denna HTML i den vänstra rutan, i mitten av de andra rutorna. Sedan kommer din ruta att infogas där med din HTML . Det finns plugins som hanterar HTML, renderarna. Normala plugins, du ger dem en array och får tillbaka en array med HTML. ",
            "Renderers": "Renderare",
            "Ready to use renderers for text, maps, images, lists, audio, video, links, forms. You can write your own renderers, it is just normal plugins.": "Infohub har renderare för text, kartor, bilder, listor, ljud, video, länkar, formulär. Du kan skriva dina egna renderare, det är bara vanliga plugins.",
            "Kick out tests": "Utföra tester",
            "InfoHub would just love to kick you out if you do not behave exactly as expected. Every call you make must pass the quick tests. There is a ban system that always give you 1 second ban time for a valid call, and more for an invalid call.": "InfoHub skulle bara älska att sparka ut dig om du inte uppträder exakt som förväntat. Varje anrop du gör måste klara alla snabbtest. Det finns ett förbudssystem som alltid ger dig 1 sekund förbudstid för ett giltigt samtal, och mer för ett ogiltigt samtal. ",
            "Automated tests": "Automatiserade tester",
            "An InfoHub plugin expect an incoming array and give an you an array back. There are no other sources of input or output, no global variables etc. The test system ask the plugin what functions it has and then call each of them with data from the test file, or an empty array. The function get the default values and give the default answer. The arrays are saved in a test file for each plugin. In a future release I will also save live data to the test system. This means that the tests write them self.": "En InfoHub-plugin förväntar sig ett inkommande array och ger dig en array tillbaka. Det finns inga andra källor till input eller output, inga globala variabler etc. Testsystemet frågar plugin-programmet vilka funktioner den har och anropar sedan var och en av dem med data från testfilen eller ger dig en tom array. Funktionen får standardvärdena och ger standardsvaren. Arrayerna sparas i en testfil för varje plugin. I en framtida utgåva kommer jag också att spara livedata i testet Detta betyder att testerna skriver dem själv. ",
            "Automated inspections": "Automatiserade inspektioner",
            "Third party interactions from the client is not allowed. The client only speak with the server. An inspector patrol the HTML and give a warning for any external link.": "Klienten pratar bara med egna servern. Klient får inte kontakta några andra servrar. En inspektör patrullerar HTML och ger en varning för externa länkar.",
            "Multi domain": "Multidomän",
            "One website can have multiple domains and sub domains. You define in the global configuration what start message should be send for each domain. There is a default fallback. You can then get different contents for each domain.": "En webbplats kan ha flera domäner och underdomäner. Du definierar i den globala konfigurationen vilket startmeddelande som ska skickas för varje domän. Det finns en fil du kan modifiera. Du kan då få olika innehåll för varje domän.",
            "Multi nodes": "Fler noder",
            "The client can only talk with the server. The server can talk with other Infohub servers on the internet. Each party is called a Node. You need login credentials to a node to exchange messages.": "Klienten kan bara prata med servern. Servern kan prata med andra Infohub-servrar på internet. Varje part kallas en nod. Du behöver inloggningsuppgifter till en nod för att utbyta meddelanden.",
            "History": "Historia",
            "The idea about a message driven system came to me in 1990 while I was designing hardware. What about a system with independent modules that can send messages to each other. My thought was that we by 2010 would expand our computers with processor modules, graphics modules, storage modules, power modules, etc in infinity. By 2000 I designed a CMS system for my home page. Written in ASP and Access databases. A great learning. Some of the ideas are now in InfoHub. 2010-01-01 started development of InfoHub. I could work some hours low quality time here and there but I never gave up. By late 2011 I became a programmer by profession, and by now I am a professional programmer. We are at 2019 and I am proud to present to you InfoHub core.": "Idén om ett meddelandedrivet system kom till mig 1990 medan jag utformade hårdvara. Vad sägs om ett system med oberoende moduler som kan skicka meddelanden till varandra. Min tanke var att vi 2010 skulle utvidga våra datorer med processormoduler, grafikmoduler, lagringsmoduler, strömmoduler osv i oändlighet. \\\\ n År 2000 designade jag ett CMS-system för min hemsida. Skrivet i ASP med en Access-databas. Det gav mig mycket kunskap. Några av idéerna är nu i InfoHub. 2010-01-01 startade utvecklingen av InfoHub. Jag kunde arbeta några timmar med låg kvalitetstid här och där, men jag gav aldrig upp. I slutet av 2011 blev jag programmerare till yrket och nu är jag en professionell programmerare. Vi är nu vid 2019 och jag är stolt över att presentera för dig den första publika versionen av InfoHub.",
            "Infohub": "Infohub"
        },
        "infohub_welcome_welcome": {
            "Welcome to your Infohub": "Välkommen till din Infohub",
            "We are going to have so much fun.": "Vi kommer att ha så mycket kul."
        },
        "infohub_welcome_youcan": {
            "You can, -with Infohub": "Du kan, med Infohub",
            "Calendar": "Kalender",
            "Write and find data in your calendar. History and future is just as important. Do not miss name days, birthdays, anniversaries, holidays, events. You can see times for the sun and moon. Links to Wikipedia for names and holidays so you can read more.": "Skriv och hitta data i din kalender. Historia och framtid är lika viktigt. Missa inte namndagar, födelsedagar, årsdagar, helgdagar, evenemang. Du kan se tider för solen och månen. Länkar till Wikipedia för namn och helgdagar så att du kan läsa mer. ",
            "Tree": "Träd",
            "With Tree you start with yourself and make bubbles on subjects around you. You could create a bubble for your cars. During your lifetime you might own more than one car and create a bubble for each car. Perhaps attach a photo and fill with any data you like. Perhaps you want a service bubble in your car to register all service you have done. When did you go to the dentist? You can create any bubble and fill the bubble with data and link to other bubbles. You can create a web with bubbles and connections - your life experiences.": "Med Tree börjar du med dig själv och gör bubblor om ämnen runt omkring dig. Du kan skapa en bubbla för dina bilar. Under din livstid kanske du äger mer än en bil och skapar en bubbla för varje bil. Kanske bifoga ett foto och fyll med alla uppgifter du gillar. Kanske vill du att en servicebubbla för din bil där du kan registrera all service du har gjort. När gick du till tandläkaren? Du kan skapa en bubbla och fylla bubblan med data och länka till andra bubblor. Du kan skapa ett nät med bubblor och anslutningar - dina livsupplevelser. ",
            "Body": "Kropp",
            "You are important! You can not exist without your body. That makes also your body important! With Body you get practical tips how you can improve your health. You can track your improvements. It is the small decisions you do every day that make a difference in your life.": "Du är viktig! Du kan inte existera utan din kropp. Det gör också din kropp viktig! Med Body får du praktiska tips om hur du kan förbättra din hälsa. Du kan spåra dina förbättringar. Det är de små besluten du gör varje dag som gör en skillnad i ditt liv. ",
            "Story editor": "Story editor",
            "Put together an article with text, images, image texts, links, titles, ingress, bullet lists, code examples. You can then export your story and use it outside of InfoHub or store it in your Tree.": "Sätt ihop en artikel med text, bilder, bildtexter, länkar, titlar, ingress, punktlistor, kodexempel. Du kan sedan exportera din berättelse och använda den utanför InfoHub eller lagra den i ditt träd.",
            "Shop": "Shop",
            "Shop trough Infohub is smooth and fast because it uses the full capacity of your computer/phone and is kid to your download quota. You have the same features on all shops and they all work the same. The shop benefit of this because more customers can shop att the same time before their server get strained.": "Handla via Infohub är smidigt och snabbt eftersom den använder din dators / telefons fulla kapacitet och är snäll mot din nedladdningskvot i ditt internetabonnemang. Du har samma funktioner i alla butiker och de fungerar lika. Butikens fördel med detta är att fler kunder kan handla på samma gång innan deras server blir ansträngd. "
        }
    }
}