{
    "version": {
        "date": "2019-10-19 20:41:38",
        "plugin": "infohub_debug",
        "data_checksum": "51ed009a608acac9310f7310e7a1781e",
        "language": "sv",
        "country": "SE",
        "file_type": "finished_file"
    },
    "launcher": {
        "title": "Avlusning",
        "description": "Verktyg du kan använda för att starta om Infohub och samtidigt rensa bort viss data. Perfekt när du behöver avlusa programkod."
    },
    "data": {
        "infohub_debug": {
            "Reload page. shift alt ctrl 1": "Laddar om sidan när ban time är slut.",
            "Clean out old plugins marked by the server. reload page. shift alt ctrl 2": "Tar bort lokala plugins som servern har nyare version av. Laddar om sidan.",
            "Clean out all local plugins, reload page. shift alt ctrl 3": "Tar bort alla lokala plugins. Laddar om sidan.",
            "Clean out all local data, reload page. shift alt ctrl 4": "Tar bort all lokal data såsom ikoner, översättningar mm. Laddar om sidan.",
            "Silently delete the render cache for the logged in user": "Radera tyst renderingscachen för den inloggade användaren",
            "Logs you out and refresh the page": "Loggar ut dig och uppdaterar sidan",
            "Instructions": "Instruktioner",
            "Click on an option or use the keyboard. These keys always works wherever you are in Infohub.": "Klicka på en av ikonerna ovan eller använd tangentbordet. Dessa knappar fungerar över allt i Infohub.",
            "Information": "Information",
            "[b]#3[/b] is also at the bottom of the Launcher screen as a button in case you can not start Debug and have no keyboard on your device.": "[b]#3[/b] finns också längst ned på programstartaren som en knapp ifall du inte kan starta Debug och inte har något tangentbord på din enhet.",
            "[b]#4[/b] is the only option that also remove icons and translations and settings from the local storage.": "[b]#4[/b] är det enda alternativet som också tar bort ikoner, översättningar mm från lokala databasen."
        }
    }
}