{
    "version": {
        "date": "2019-03-25 06:20:00",
        "plugin": "infohub_demo",
        "data_checksum": "1144d62d4e6f3cd40d544d8df2c1a0d1",
        "language": "sv",
        "country": "SE",
        "file_type": "finished_file"
    },
    "data": {
        "infohub_demo": {
            "Instructions": "Instruktioner",
            "Use the menu.": "Använd menyn.",
            "This link works and goes to infohub_demo -> event_message.": "Den här länken fungerar och går till infohub_demo -> event_message.",
            "This button works and goes to infohub_demo -> event_message.": "Den här knappen fungerar och går till infohub_demo -> event_message.",
            "This submit button works and goes to infohub_demo -> event_message. This only happens if all data is valid.": "Den här inlämningsknappen fungerar och går till infohub_demo -> event_message. Det här händer bara om all data är giltig."
        },
        "infohub_demo_advancedlist": {
            "Clothes": "Kläder",
            "Foot": "Fot",
            "Socks": "Strumpor",
            "Leg": "Ben",
            "Jeans": "Jins",
            "Body": "Kropp",
            "T-Shirt": "T-Tröja",
            "Jacket": "Jacka",
            "Hand": "Hand",
            "Mittens": "Vantar",
            "Head": "Huvud",
            "Hat": "Hatt",
            "Helmet": "Hjälm",
            "Hockey": "Hockey",
            "Bicycle": "Cykla",
            "Navigation": "Navigering",
            "This is an example of an advanced list. You can expand the nodes and click on the labels.": "Detta är ett exempel på en avancerad lista. Du kan expandera noderna och klicka på etiketterna.",
            "View": "Visa",
            "Viewing area": "Visningsområde"
        },
        "infohub_demo_audio": {
            "Welcome to InfoHub Demo Audio": "Välkommen till InfoHub Demo Audio",
            "Here are some demos to show you what Infohub can do with embedded Audio. You should ALWAYS use a presentation box for 3rd party material because you then give the user an option not to click.": "Här är några demonstrationer för att visa dig vad Infohub kan göra med inbäddad ljud. Du ska alltid använda en presentationslåda för tredje partens material eftersom du då ger användaren ett alternativ att inte klicka på.",
            "This is a Jamendo audio album": "Detta är ett Jamendo ljudalbum",
            "Jamendo is a 3rd party audio streaming service. Use it in a presentation box.": "Jamendo är en tredjeparts audio streaming service. Använd den i en presentationsruta.",
            "This is a Jamendo audio track": "Detta är ett Jamendo ljudspår",
            "This is a Soundcloud audio playlist": "Detta är en Soundcloud ljudspellista",
            "Soundcloud is a 3rd party audio streaming service. Use it in a presentation box.": "Soundcloud är en tredje parts audio streaming service. Använd den i en presentationsruta.",
            "This is a Soundcloud audio track": "Detta är ett Soundcloud ljudspår",
            "This is a Spotify audio album": "Detta är ett Spotify ljudalbum",
            "Spotify is a 3rd party audio streaming service. Use it in a presentation box.": "Spotify är en tredje parts audio streaming service. Använd den i en presentationsruta.",
            "This is a Spotify audio track": "Detta är ett Spotify ljudspår"
        },
        "infohub_demo_common": {
            "Time": "Tid",
            "This is a legend": "Detta är en legend",
            "Does not track you": "Spårar inte dig",
            "Does not [u]sell[/u] you anything": "Säljer dig inte dig någonting",
            "That is why I [:-)] like them": "Det är därför jag [:-)] gillar dem",
            "[h1]Common demo[/h1]": "[h1]Vanligt demo[/h1]",
            "[i]Plugin infohub_render_common are used in this demo. You see a combination of what render_common can do. Here is a list what parts you see in the example:[/i]": "[i]Plugin infohub_render_common används i detta demo. Du ser en kombination av vad render_common kan göra. Här är en lista vilka delar du ser i exemplet:[/i]",
            "The first image is in JPEG format 700 pixels wide 30Kb. The second image is in PNG format black&white, 240 pixels wide and 17Kb and then upscaled to 640 pixels wide. You can see several things here:": "Första bilen är en JPEG format 700 pixelar bred 30Kb. Andra bilden är i PNG format svart&vit, 240 pixelar bred och 17Kb och sedan uppskalad till 640 pixelars bredd. Du kan se många saker här:",
            "list - Bullet list like this one": "lista - Bullet lista som den här",
            "value - Any value, used here for the time stamp": "värde - valfritt värde som används här för tidsstämpeln",
            "image - The photo is an image, the duck too": "bild - Bilden är en bild, andan också",
            "legend - a frame with a label. You can put things in it": "legend - en ram med en etikett. Du kan lägga saker i den",
            "iframe - a box with 3rd party contents. Use with caution": "iframe - en låda med innehåll från tredje part. Använd försiktigt",
            "container - a span, div or p tag that you can put things in": "behållare - en span, div eller p-tagg som du kan lägga saker i",
            "Use JPEG for photographs": "Använd JPEG för fotografier",
            "Use PNG for small detailed images where you can not use SVG or JPEG": "Använd PNG för små detaljerade bilder där du inte kan använda SVG eller JPEG",
            "Use a resolution close to the viewed resolution. Do not upscale. Avoid downscaling too much.": "Använd en upplösning nära den uppnådda upplösningen. Uppskal inte. Undvik nedskalning för mycket."
        },
        "infohub_demo_document": {
            "Select file": "Välj en fil",
            "Load example": "Ladda in exampel",
            "Write your markdown text here or press the button above to select a local text file.": "Skriv din markdown text här eller tryck på knappen ovan för att välja en lokal textfil.",
            "Markdown to HTML": "Markdown till HTML"
        },
        "infohub_demo_form": {
            "Welcome to InfoHub Demo Form": "Välkommen till InfoHub Demo Form",
            "Here are some demos to show you what Infohub can do with forms.": "Här är några demonstrationer för att visa dig vad Infohub kan göra med formulär.",
            "A fieldset with demo form elements": "En fältuppsättning med demoformelement",
            "My button": "Min knapp",
            "Write something nice here": "Skriv något bra här",
            "Your meal": "Din måltid",
            "What do you want on your hamburger": "Vad vill du ha på din hamburgare",
            "Bread": "Bröd",
            "Normal bread": "Normalt bröd",
            "Fiber bread": "Fiberbröd",
            "Burger": "Burger",
            "Green burger": "Grön burger",
            "Boar burger": "Boar burger",
            "Extras": "Extra",
            "Cheese": "Ost",
            "Salad": "Sallad",
            "Mustard": "Senap",
            "Union": "Union",
            "Extra": "Extra",
            "Below you can press the button to download a text file with a greeting. Example of downloading files.": "Nedan kan du trycka på knappen för att ladda ned en textfil med en hälsning. Exampel på at ladda ned filer.",
            "Download file": "Hämta fil",
            "Below you can press the button to get a file selector. Select one or more jpeg images. They will be read and shown under the button.": "Nedan kan du trycka på knappen för att få en filväljare. Välj en eller fler jpeg-bilder. De kommer ar läsas in och visas under knappen."
        },
        "infohub_demo_form2": {
            "Welcome to the InfoHub Demo for more advanced forms": "Välkommen till InfoHub Demo för mer avancerade formulär",
            "In this demo you can order a meal at a restaurant. All the form elements are used in this demo.": "I denna demo kan du beställa en måltid på en restaurang. Alla formelement används i denna demo.",
            "Your burger meal": "Din hamburgermåltid",
            "Please select the details for your burger meal.": "Vänligen välj detaljerna för din burgermåltid.",
            "Order your Meal": "Beställ din måltid",
            "Quick burger": "Snabb hamburgare",
            "Lunch burger": "Lunchburgare",
            "Dinner burger": "Middagsburgare",
            "Alias": "Alias",
            "Frying the burger": "Steka din burgare",
            "How much du you want us to fry the burger, from lightly touching the pan up to meteorite": "Hur mycket du vill att vi ska steka burgaren, från att lätt röra pannan upp till meteoriten",
            "Side dish": "Sidrätter",
            "What do you want to make your meal even better": "Vad vill du göra din måltid ännu bättre",
            "Nothing": "Inget",
            "Cutlery": "Bestick",
            "Knife": "Kniv",
            "Fork": "Gaffel",
            "Porcelain": "Porslin",
            "Plait": "Plait",
            "Glass": "Glas",
            "Fabric": "Tyg",
            "Napkin": "Servett",
            "Table Cloth": "Bordduk",
            "Your special requests": "Dina speciella önskemål",
            "Special requests": "Särskilda önskemål",
            "If you have some special requests for your meal then write them here.": "Om du har några speciella önskemål om din måltid skriver du dem här.",
            "A date meal": "En datummat",
            "An after movie meal": "En efter filmmåltid",
            "A before movie meal": "A before movie meal",
            "Ultra running meal": "Ultraläparens måltid",
            "Meal during shopping": "Måltid under shopping",
            "Bread": "Bröd",
            "What kind of bread do you want?": "Vilken typ av bröd vill du ha?",
            "Plain bread": "Vanligt bröd",
            "Fiber bread": "Fiberbröd",
            "Sesam bread": "Sesambröd",
            "Burger": "Burger",
            "What kind of burger do you want?": "Vilken typ av burger vill du ha?",
            "Tofu burger": "Tofuburgare",
            "Halloumi burger": "Halloumiburgare",
            "Soy burger": "Soyaburgare",
            "Carrot based burger": "morotbaserad burgare",
            "Beetroot based burger": "Rödbetsburgare",
            "Burger extras": "Tillbehör",
            "Extras that we can add to your burger": "Extra som vi kan lägga till din burger",
            "Cheese": "Ost",
            "Salad": "Sallad",
            "Mustard": "Senap",
            "Union": "Union",
            "Pickles": "Pickles",
            "Of age": "Ålder",
            "I am 18 years or older": "Jag är 18 år eller äldre",
            "Flower": "Blomma",
            "You get a flower on the table. Select a colour and we will do a close match with the flowers we have.": "Du får en blomma på bordet. Välj en färg och vi kommer att göra en nära match med de blommor vi har.",
            "nothing special": "inget speciellt",
            "Only vegetables and spices": "Endast grönsaker och kryddor",
            "I want to go all in with this dinner. Dion mustard and Romani salad!!": "Jag vill gå fyllt ut med denna middag. Dion senap och Romansalat !!"
        },
        "infohub_demo_frog": {
            "Instructions": "Instruktioner",
            "Result": "Resultat",
            "When you do a misstake in your rendering code then the frog shows up as a placeholder.": "När du gör en felaktighet i din renderingskod visas grodan som en platshållare.",
            "Have you seen any frogs?": "Har du sett några grodor?",
            "I made a frog is a Swedish expression for making a mistake. Jag gjorde en groda. If you render an object with an unknown type or subtype then a frog appear instead.": "Jag gjorde en groda är ett svenskt uttryck för att göra ett misstag. Jag gjorde en groda. Om du gör ett objekt med en okänd typ eller undertyp så visas en groda istället.",
            "Make a frog": "Gör en groda",
            "Correct way": "Rätt sätt",
            "Misstake #1 - Wrong type": "Felaktighet # 1 - Fel typ",
            "Misstake #2 - Wrong subtype": "Misstake # 2 - Fel subtyp",
            "Correct, The frog is rendered by calling the render_frog plugin.": "Rätt, Grodan är renderad genom att kalla på render_frog plugin.",
            "Mistake #1, The frog were rendered by calling render_common with the none existing subtype fizbaz. That gives a frog and an error message on top.": "Misstag #1, Grodan renderades genom att kalla på render_common med den icke existerande subtypen fizbaz. Det get en groda och ett felmeddelande högst upp.",
            "Mistake #2, The frog were rendered by calling the none existing plugin foobar. That gives a frog and an error message on top.": "Misstag #2, Grodan renderades genom att kalla på den icke existerande pluginen foobar. Det get en groda och ett felmeddelande högst upp."
        },
        "infohub_demo_link": {
            "Welcome to InfoHub Demo Link": "Välkommen till InfoHub Demo Link",
            "Here are some demos to show you what Infohub can do with links.": "Här är några demonstrationer för att visa dig vad Infohub kan göra med länkar.",
            "A normal event link": "En vanlig händelselänk",
            "Toggle the image show/hide": "Byt bildvisning/göm",
            "My external link to the ABC club": "Min externa länk till ABC-klubben",
            "Embedded content - Click to substitute this text": "Inbäddat innehåll - Klicka för att ersätta denna text",
            "The event link": "Händelsen länken",
            "This is what is rendered when you press the event link. Event links always come to the level 1 plugin in function event_message. From there you can do whatever you want. I wanted to render this.": "Det här är vad som görs när du trycker på händelselänket. Eventlänkar kommer alltid till nivå 1-plugin i funktionen event_message. Därifrån kan du göra vad du vill. Jag ville göra det här."
        },
        "infohub_demo_major": {
            "Put a title on it": "Sätt en titel på det",
            "My content, click to see the embedded content": "Mitt innehåll, klicka för att se det inbäddade innehållet",
            "My embedded data": "Min inbäddade data",
            "Embeds another image": "Inbjuder till en annan bild",
            "Click on the image to see the embedded image": "Klicka på bilden för att se den inbäddade bilden",
            "No links, just displays an image": "Inga länkar, visar bara en bild",
            "My external link to the ABC club": "Min externa länk till ABC-klubben"
        },
        "infohub_demo_map": {
            "Welcome to InfoHub Demo Map": "Välkommen till InfoHub Demo Map",
            "Here are some demos to show you what Infohub can do with embedded Map. You should ALWAYS use a presentation box for 3rd party material because you then give the user an option not to click.": "Här är några demonstrationer för att visa dig vad Infohub kan göra med inbäddad karta. Du bör alltid använda en presentationsruta för tredje partens material eftersom du då ger användaren ett alternativ att inte klicka.",
            "This is a Openstreet map": "Detta är en Openstreet-karta",
            "Openstreetmap is a 3rd party map streaming service. Use it in a presentation box.": "Openstreetmap är en 3: e parts kartströmmingstjänst. Använd den i en presentationsruta.",
            "This is a Googlemaps": "Detta är en Googlemaps",
            "Googlemaps is a 3rd party map streaming service. Use it in a presentation box.": "Googlemaps är en tredjeparts kartströmmingstjänst. Använd den i en presentationsruta.",
            "This is a Bing map": "Detta är en Bing-karta",
            "Bing is a 3rd party map streaming service. Use it in a presentation box.": "Bing är en tredjeparts kartströmservice. Använd den i en presentationsruta."
        },
        "infohub_demo_markdown": {
            "Write your markdown text here or press the button above to select a local text file.": "Skriv din markdowntext här eller tryck på knappen ovan för att välja en lokal textfil.",
            "Markdown renderer": "Markdownrenderare",
            "Select what markdown renderer you want to test": "Välj vilken markdownrenderare du vill använda",
            "Markdown to HTML": "Markdown till HTML"
        },
        "infohub_demo_menu": {
            "Demo Collection": "Demosamling",
            "Text demo": "Textdemo",
            "Common objects demo": "Vanliga objekt demo",
            "You get a frog": "Du får en groda",
            "Audio stream services": "Audio Stream Services",
            "Map services": "Karttjänster",
            "Link - different kinds": "Länk - olika slag",
            "Presentation box": "Presentationslåda",
            "Advanced list": "Avancerad lista",
            "Tabs list": "Fliklista",
            "Form - simple": "Form - enkel",
            "Form - Advanced": "Form - Avancerad",
            "Markdown text": "Markdowntext",
            "Document text": "Dokumenttext"
        },
        "infohub_demo_text": {
            "Welcome to InfoHub Demo Text": "Välkommen till InfoHub Demo Text",
            "Plugin infohub_render_text is used in this demo. You can use text to bind together rendered objects.": "Plugin infohub_render_text används i denna demo. Du kan använda text för att binda samman renderade objekt.",
            "My external link to the ABC club": "Min externa länk till ABC-klubben"
        },
        "infohub_demo_video": {
            "Welcome to InfoHub Demo Video": "Välkommen till InfoHub Demo Video",
            "Here are some demos to show you what Infohub can do with embedded Video. You should ALWAYS use a presentation box for 3rd party material because you then give the user an option not to click.": "Här är några demonstrationer för att visa dig vad Infohub kan göra med inbäddad video. Du bör alltid använda en presentationslåda för tredje partens material eftersom du då ger användaren ett alternativ att inte klicka.",
            "First we have a Youtube presentation box. [youtube_major] And then we have a Vimeo video [vimeo_major] And here we have a Daily motion video. [dailymotion_major]": "Först har vi en Youtube presentationsbox. [youtube_major] Och sedan har vi en Vimeo video [vimeo_major] Och här har vi en Daily motion video. [dailymotion_major]",
            "This is a Youtube video": "Detta är en Youtube-video",
            "Youtube is a 3rd party video streaming service. Use it in a presentation box.": "Youtube är en tredjeparts videostreamingtjänst. Använd den i en presentationsruta.",
            "In new tab": "I ny flik",
            "This is a Vimeo video": "Detta är en Vimeo-video",
            "Vimeo is a 3rd party video streaming service. Use it in a presentation box.": "Vimeo är en tredjeparts videostreamingtjänst. Använd den i en presentationsruta.",
            "This is a Daily motion video": "Detta är en Daily motion video",
            "Daily motion is a 3rd party video streaming service. Use it in a presentation box.": "Daily motion är en tredjeparts videostreamingtjänst. Använd den i en presentationsruta."
        }
    }
}