{
    "version": {
        "date": "2020-07-05 13:48:06",
        "plugin": "infohub_demo",
        "data_checksum": "cbae21bb9378b574b08aeabec3493e84",
        "language": "sv",
        "country": "SE",
        "file_type": "finished_file"
    },
    "data": {
        "infohub_demo": {
            "Instructions": "Instruktioner",
            "Use the menu.": "Använd menyn.",
            "This link works and goes to infohub_demo -> event_message.": "Den här länken fungerar och går till infohub_demo -> event_message.",
            "This button works and goes to infohub_demo -> event_message.": "Den här knappen fungerar och går till infohub_demo -> event_message.",
            "This submit button works and goes to infohub_demo -> event_message. This only happens if all data is valid.": "Denna skicka-knapp fungerar och går till infohub_demo -> event_message. Detta händer bara om all data är giltig."
        },
        "infohub_demo_advancedlist": {
            "Clothes": "Kläder",
            "Foot": "Fot",
            "Socks": "Strumpor",
            "Leg": "Ben",
            "Jeans": "Jeans",
            "Body": "Kropp",
            "T-Shirt": "T-shirt",
            "Jacket": "Jacka",
            "Hand": "Hand",
            "Mittens": "Vanten",
            "Head": "Huvud",
            "Hat": "Hat",
            "Helmet": "Hjälm",
            "Hockey": "Hockey",
            "Bicycle": "Cykel",
            "Navigation": "Navigering",
            "This is an example of an advanced list. You can expand the nodes and click on the labels.": "Detta är ett exempel på en avancerad lista. Du kan utöka noderna och klicka på etiketterna.",
            "View": "Visa",
            "Viewing area": "Visningsområde"
        },
        "infohub_demo_audio": {
            "Welcome to InfoHub Demo Audio": "Välkommen till InfoHub Demo Audio",
            "Here are some demos to show you what Infohub can do with audio.": "Här är några demonstrationer som visar dig vad Infohub kan göra med ljud.",
            "Infohub Client do not use 3rd party services. All data must come from the server": "Infohub-klienten använder inte tjänster från tredje part. All data måste komma från servern",
            "This is a %s": "Detta är en %s",
            "%s is a 3rd party audio streaming service.": "%s är en ljudströmningstjänst från tredje part.",
            "In new tab": "I ny flik"
        },
        "infohub_demo_common": {
            "Time": "Tid",
            "This is a legend": "Detta är en legend",
            "Does not track you": "Spårar inte dig",
            "Does not [u]sell[/u] you anything": "Säljer inget till dig",
            "That is why I [:-)] like them": "Det är därför jag [:-)] gillar dem",
            "[h1]Common demo[/h1]": "[h1]Gemensam demo[/h1]",
            "[i]Plugin infohub_render_common are used in this demo. You see a combination of what render_common can do. Here is a list what parts you see in the example:[/i]": "[i]Plugin infohub_render_common används i den här demonstrationen. Du ser en kombination av vad render_common kan göra. Här är en lista över vilka delar du ser i exemplet: [/i]",
            "The first image is in JPEG format 700 pixels wide 30Kb. The second image is in PNG format black&white, 240 pixels wide and 17Kb and then upscaled to 640 pixels wide. You can see several things here:": "Den första bilden är i JPEG-format 700 pixlar bred 30 kb. Den andra bilden är i PNG-format svartvit, 240 pixlar bred och 17 kb och sedan uppskalad till 640 pixlar bred. Du kan se flera saker här:",
            "list - Bullet list like this one": "lista - Bulletlista som den här",
            "value - Any value, used here for the time stamp": "värde - Vilket värde som används här för tidsstämpeln",
            "image - The photo is an image, the duck too": "bild - Bildet är en bild, ankan också",
            "legend - a frame with a label. You can put things in it": "legend - en ram med etikett. Du kan lägga saker i den",
            "iframe - a box with 3rd party contents. Use with caution": "iframe - en ruta med innehåll från tredje part. Använd med försiktighet",
            "container - a span, div or p tag that you can put things in": "behållare - en spänn-, div- eller p-tagg som du kan sätta saker i",
            "Use JPEG for photographs": "Använd JPEG för fotografier",
            "Use PNG for small detailed images where you can not use SVG or JPEG": "Använd PNG för små detaljerade bilder där du inte kan använda SVG eller JPEG",
            "Use a resolution close to the viewed resolution. Do not upscale. Avoid downscaling too much.": "Använd en upplösning nära den visade upplösningen. Förstora inte. Undvik att förminska för mycket."
        },
        "infohub_demo_document": {
            "Select file": "Välj fil",
            "Load example": "Ladda exempel",
            "Write your markdown text here or press the button above to select a local text file.": "Skriv din markdowntext här eller tryck på knappen ovan för att välja en lokal textfil.",
            "Markdown to HTML": "Markdown till HTML"
        },
        "infohub_demo_form": {
            "Welcome to InfoHub Demo Form": "Välkommen till InfoHub Demo Form",
            "Here are some demos to show you what Infohub can do with forms.": "Här är några demonstrationer för att visa vad Infohub kan göra med formulär.",
            "A fieldset with demo form elements": "En fältuppsättning med demoformelement",
            "My button": "Min knapp",
            "Write something nice here": "Skriv något trevligt här",
            "Your meal": "Din måltid",
            "What do you want on your hamburger": "Vad vill du ha på din hamburgare",
            "Bread": "Bröd",
            "Normal bread": "Normalt bröd",
            "Fiber bread": "Fiberbröd",
            "Burger": "Burger",
            "Green burger": "Grön hamburgare",
            "Boar burger": "Boarburgare",
            "Extras": "Extra",
            "Cheese": "Ost",
            "Salad": "Sallad",
            "Mustard": "Senap",
            "Union": "Union",
            "Extra": "Extra",
            "Below you can press the button to download a text file with a greeting. Example of downloading files.": "Nedan kan du trycka på knappen för att ladda ner en textfil med en hälsning. Exempel på nedladdning av filer.",
            "Download file": "Ladda ner fil",
            "Below you can press the button to get a file selector. Select one or more jpeg images. They will be read and shown under the button.": "Nedan kan du trycka på knappen för att få en filväljare. Välj en eller flera jpeg-bilder. De kommer att läsas och visas under knappen.",
            "Select images": "Välj bilder"
        },
        "infohub_demo_form2": {
            "Welcome to the InfoHub Demo for more advanced forms": "Välkommen till InfoHub-demo för mer avancerade formulär",
            "In this demo you can order a meal at a restaurant. All the form elements are used in this demo.": "I den här demonstrationen kan du beställa en måltid på en restaurang. Alla formelement används i den här demonstrationen.",
            "Your burger meal": "Din burgermåltid",
            "Please select the details for your burger meal.": "Välj detaljer för din burgermåltid.",
            "Order your Meal": "Beställ ditt måltid",
            "Quick burger": "Snabbburger",
            "Lunch burger": "Lunchburgare",
            "Dinner burger": "Middagsburgare",
            "Alias": "Alias",
            "Your alias for this burger order, so you can easily reorder at a later time": "Ditt alias för den här burgerbeställningen, så att du enkelt kan beställa igen vid ett senare tillfälle",
            "Frying the burger": "Steka hamburgaren",
            "How much du you want us to fry the burger, from lightly touching the pan up to meteorite": "Hur mycket du vill att vi ska steka hamburgaren, från att lätt röra pannan upp till meteorit",
            "Side dish": "Bordsskiva",
            "What do you want to make your meal even better": "Vad vill du göra din måltid ännu bättre",
            "Nothing": "Ingenting",
            "Cutlery": "Bestick",
            "Knife": "Kniv",
            "Fork": "Gaffel",
            "Porcelain": "Porslin",
            "Plait": "Fläta",
            "Glass": "Glas",
            "Fabric": "Tyg",
            "Napkin": "Servett",
            "Table Cloth": "Bordduk",
            "Your special requests": "Dina specialförfrågningar",
            "Special requests": "Specialförfrågningar",
            "If you have some special requests for your meal then write them here.": "Om du har några speciella önskemål för din måltid, skriv dem här.",
            "A date meal": "En datummåltid",
            "An after movie meal": "En efter filmmåltid",
            "A before movie meal": "A före filmmåltid",
            "Ultra running meal": "Ultralöpande måltid",
            "Meal during shopping": "Måltid under shopping",
            "Bread": "Bröd",
            "What kind of bread do you want?": "Vilken typ av bröd vill du ha?",
            "Plain bread": "Vanligt bröd",
            "Fiber bread": "Fiberbröd",
            "Sesam bread": "Sesambröd",
            "Burger": "Burger",
            "What kind of burger do you want?": "Vilken typ av hamburgare vill du ha?",
            "Tofu burger": "Tofu-hamburgare",
            "Halloumi burger": "Halloumi-hamburgare",
            "Soy burger": "Sojaburger",
            "Carrot based burger": "Morotbaserade hamburgare",
            "Beetroot based burger": "Rödbetor baserad hamburgare",
            "Burger extras": "Burger extra",
            "Extras that we can add to your burger": "Extra som vi kan lägga till din hamburgare",
            "Cheese": "Ost",
            "Salad": "Sallad",
            "Mustard": "Senap",
            "Union": "Union",
            "Pickles": "Pickles",
            "Of age": "Ålder",
            "I can only sell to you if you are of age": "Jag kan bara sälja till dig om du är myndig",
            "I am 18 years or older": "Jag är 18 år eller äldre",
            "Flower": "Blomma",
            "You get a flower on the table. Select a colour and we will do a close match with the flowers we have.": "Du får en blomma på bordet. Välj en färg så gör vi en nära matchning med de blommor vi har.",
            "nothing special": "inget speciellt",
            "Only vegetables and spices": "Endast grönsaker och kryddor",
            "I want to go all in with this dinner. Dion mustard and Romani salad!!": "Jag vill gå all in med den här middagen. Dion senap och Romani sallad !!",
            "This submit button works and goes to infohub_demo. This only happens if all data is valid.": "Den här skicka-knappen fungerar och går till infohub_demo. Detta händer bara om all data är giltig."
        },
        "infohub_demo_frog": {
            "Instructions": "Instruktioner",
            "Result": "Resultat",
            "When you do a misstake in your rendering code then the frog shows up as a placeholder.": "När du gör fel i din renderingskod visas grodan som en platshållare.",
            "Have you seen any frogs?": "Har du sett några grodor?",
            "I made a frog is a Swedish expression for making a mistake. Jag gjorde en groda. If you render an object with an unknown type or subtype then a frog appear instead.": "Jag gjorde en groda är ett svenskt uttryck för att göra ett misstag. Jag gjorde en groda. Om du återger ett objekt med en okänd typ eller subtyp så visas en groda istället.",
            "Make a frog": "Gör en groda",
            "Correct way": "Rätt sätt",
            "Misstake #1 - Wrong type": "Misstag #1 - Fel typ",
            "Misstake #2 - Wrong subtype": "Misstag #2 - Fel subtype",
            "Correct, The frog is rendered by calling the render_frog plugin.": "Rätt, grodan återges genom att ringa render_fragmentet plugin.",
            "Mistake #1, The frog were rendered by calling render_common with the none existing subtype fizbaz. That gives a frog and an error message on top.": "Fel nr 1, grodan gavs genom att ringa render_common med ingen existerande subtyp fizbaz. Det ger en groda och ett felmeddelande på toppen.",
            "Mistake #2, The frog were rendered by calling the none existing plugin foobar. That gives a frog and an error message on top.": "Fel nr 2, grodan gjordes genom att ringa den existerande plugin-foobar. Det ger en groda och ett felmeddelande på toppen."
        },
        "infohub_demo_link": {
            "Welcome to InfoHub Demo Link": "Välkommen till InfoHub-demolänk",
            "Here are some demos to show you what Infohub can do with links.": "Här är några demonstrationer som visar dig vad Infohub kan göra med länkar.",
            "A normal event link": "En normal händelselänk",
            "Toggle the image show/hide": "Växla bildvisning / dölj",
            "My external link to the ABC club": "Min externa länk till ABC-klubben",
            "Embedded content - Click to substitute this text": "Inbyggt innehåll - Klicka för att ersätta denna text",
            "The event link": "Händelselänken",
            "This is what is rendered when you press the event link. Event links always come to the level 1 plugin in function event_message. From there you can do whatever you want. I wanted to render this.": "Det här är vad som ges när du trycker på händelselänken. Eventlänkar kommer alltid till nivå 1-plugin i funktionen event_message. Därifrån kan du göra vad du vill. Jag ville göra detta."
        },
        "infohub_demo_major": {
            "Put a title on it": "Sätt en titel på den",
            "My content, click to see the embedded content": "Mitt innehåll, klicka för att se det inbäddade innehållet",
            "My embedded data": "Mina inbäddade data",
            "Embeds another image": "Bäddar in en annan bild",
            "Click on the image to see the embedded image": "Klicka på bilden för att se den inbäddade bilden",
            "No links, just displays an image": "Inga länkar, visar bara en bild",
            "My external link to the ABC club": "Min externa länk till ABC-klubben"
        },
        "infohub_demo_map": {
            "Welcome to InfoHub Demo Map": "Välkommen till Demokarta för InfoHub",
            "Here are some demos to show you what Infohub can do with maps.": "Här är några demonstrationer för att visa vad Infohub kan göra med kartor.",
            "Infohub Client do not use 3rd party services. All data must come from the server": "Infohub-klienten använder inte tjänster från tredje part. All data måste komma från servern",
            "This is a %s": "Detta är en %s",
            "%s is a 3rd party map streaming service.": "%s är en strömningstjänst för kartor från tredje part.",
            "In new tab": "I ny flik"
        },
        "infohub_demo_menu": {
            "Demo Collection": "Demosamling",
            "Text demo": "Textdemo",
            "Common objects demo": "Demo för vanliga objekt",
            "SVG rendering demo": "SVG-renderingdemo",
            "You get a frog": "Du får en groda",
            "Video stream services": "Videoströmtjänster",
            "Audio stream services": "Ljudströmtjänster",
            "Map services": "Karttjänster",
            "Link - different kinds": "Länkar av olika slag",
            "Presentation box": "Presentationsbox",
            "Advanced list": "Avancerad lista",
            "Tabs list": "Listor över flikar",
            "Form - simple": "Formulär - Enkelt",
            "Form - Advanced": "Formulär - Avancerat",
            "Table": "Tabell",
            "Document text": "Dokumenttext",
            "Timer": "Nedräkning",
            "Storage": "Lagring"
        },
        "infohub_demo_storage": {
            "InfoHub Demo Storage": "InfoHub Demo Storage",
            "You can test the Storage on the client and server": "Du kan testa lagring på klienten och servern",
            "Write": "Skriva",
            "Select options and press button to write": "Välj alternativ och tryck på knappen för att skriva",
            "Node": "Nod",
            "Client": "Klient",
            "Server": "Server",
            "Mode": "Läge",
            "overwrite": "skriva över",
            "merge": "sammanfoga",
            "Path": "Sökväg",
            "/a/test1": "/a/test1",
            "/b/test2": "/b/test2",
            "/b/test3": "/b/test3",
            "/c/test4": "/c/test4",
            "All four": "Alla fyra",
            "/b/*": "/b/*",
            "Data": "Data",
            "Adam": "Adam",
            "Bertil": "Bertil",
            "Cesar": "Cesar",
            "Flag true": "Flagga sant",
            "Flag false": "Flagga falskt",
            "Empty": "Tom",
            "Read": "Läs",
            "Select options and press button to read": "Välj alternativ och tryck på knappen för att läsa",
            "Wanted data": "Önskad data",
            "First name": "Förnamn",
            "Last name": "Efternamn",
            "Here you will see the data we read from Storage": "Här ser du de data vi läste från lagring",
            "Read data": "Läs data",
            "The data read from Storage.": "Uppgifterna läses från lagring."
        },
        "infohub_demo_svg": {
            "Welcome to InfoHub Demo SVG": "Välkommen till InfoHub-demo SVG",
            "Here are some demos to show you what Infohub can do with Infohub SVG. If you instead want to use existing SVG files then have a look at infohub render common.": "Här är några demonstrationer som visar dig vad Infohub kan göra med Infohub SVG. Om du istället vill använda befintliga SVG-filer så titta på infohub render vanligt.",
            "Rectange": "Rektangel",
            "A simple rectangle": "En enkel rektangel",
            "Circle": "Cirkel",
            "A simple circle": "En enkel cirkel",
            "Shadow": "Skugga",
            "How to do shadows": "Hur man gör skuggor"
        },
        "infohub_demo_table": {
            "Id": "Id",
            "View": "Visa",
            "Name": "Namn",
            "Year": "År",
            "Score": "Poäng",
            "E-mail": "E-post",
            "Image": "Bild",
            "This is a legend": "Detta är en legend",
            "Clicked row with ID:": "Klicka på rad med ID:"
        },
        "infohub_demo_text": {
            "Welcome to InfoHub Demo Text": "Välkommen till InfoHub-demotext",
            "Plugin infohub_render_text is used in this demo. You can use text to bind together rendered objects.": "Plugin infohub_render_text används i den här demonstrationen. Du kan använda text för att binda samman renderade objekt.",
            "The text renderer is the most important renderer of them all. It acts as the glue that combine together all the other rendered pieces.": "Textavgivaren är den viktigaste återgivaren av dem alla. Den fungerar som limet som kombinerar alla andra återgivna bitar.",
            "[h2]Built in commands[/h2] You can do this [:-)][:-(][(c)][(r)][tel][eur], you can also use [b]bold[/b], [i]italic[/i], [u]underline[/u], or a line like this [line][br]": "[h2]Inbyggda kommandon[/h2] Du kan göra detta [:-)] [:-(] [(c)] [(r)] [tel] [eur], du kan också använda [b]fet[/b], [i]kursiv[/i], [u]understrykning[/u] eller en rad som den här [line][br] ",
            "[h2]Columns[/h2]You can activate columns. Then you automatically get columns that your text can flow in. You can [light]highlight portions of the text like this[/light] ": "[h2]Kolumner[/h2] Du kan aktivera kolumner. Då får du automatiskt kolumner som din text kan flyta i. Du kan [light] markera delar av texten som denna [/light]",
            "and you can include other elements in your text, for example: [my_external_link].": "och du kan inkludera andra element i din text, till exempel: [my_external_link].",
            "[h2]Zoom level[/h2]You can zoom the view in your browser. When you do that and the space is to narrow for the column, then it reduces the number of columns. You always get a readable view in all zoom levels.": "[h2]Zoomnivå[/h2] Du kan zooma in vyn i din webbläsare. När du gör det och utrymmet är att begränsa för kolumnen, minskar det antalet kolumner. Du får alltid en läsbar visa i alla zoomnivåer. ",
            "[h2]Sections[/h2]You see that the h2 sections do not wrap nice in the columns. There are css commands to fix that in most browsers. I have that on my todo list.": "[h2]Avsnitt[/h2] Du ser att h2-avsnitten inte lindras fint i kolumnerna. Det finns css-kommandon för att fixa det i de flesta webbläsare. Jag har det på min todo-lista.",
            "My external link to the ABC club": "Min externa länk till ABC-klubben"
        },
        "infohub_demo_timer": {
            "Timer demo": "Nedräkningsdemo",
            "Press the buttons to change the colours": "Tryck på knapparna för att ändra färger",
            "Red": "Röd",
            "Green": "Grön",
            "Blue": "Blå",
            "Advanced Timer demo": "Avancerad nedräkning",
            "Press the button to start the demo": "Tryck på knappen för att starta demonstrationen",
            "Advanced timer": "Avancerad nedräkning",
            "The result": "Resultatet",
            "Number": "Nummer",
            "wait": "vänta",
            "Simulate sending": "Simulera sändning"
        },
        "infohub_demo_video": {
            "Welcome to InfoHub Demo Video": "Välkommen till InfoHub-demonstrationsvideo",
            "Here are some demos to show you what Infohub can do with video.": "Här är några demonstrationer för att visa vad Infohub kan göra med video.",
            "Infohub Client do not use 3rd party services. All data must come from the server": "Infohub-klienten använder inte tjänster från tredje part. All data måste komma från servern",
            "First we have a Youtube presentation box.": "Först har vi en Youtube-presentationsbox.",
            "And then we have a Vimeo video": "Och sedan har vi en Vimeo-video",
            "And here we have a Daily motion video.": "Och här har vi en Daily motion-video.",
            "This is a %s": "Detta är en %s",
            "%s is a 3rd party video streaming service.": "%s är en videoströmningstjänst från tredje part.",
            "In new tab": "I ny flik"
        }
    }
}
